ranjithaguna/pv/LED_Demo/source/pic32cx/component/gpio_200_236.h
/** \brief GPIO_200_236 register offsets definitions */
#define GPIO_200_236_GPIO_200_PIN_CONTROL_OFFSET (0x00)         /**< (GPIO_200_236_GPIO_200_PIN_CONTROL) GPIO200 Pin Control Offset */
#define GPIO_200_236_GPIO_201_PIN_CONTROL_OFFSET (0x04)         /**< (GPIO_200_236_GPIO_201_PIN_CONTROL) GPIO 201 Pin Control Offset */
#define GPIO_200_236_GPIO_202_PIN_CONTROL_OFFSET (0x08)         /**< (GPIO_200_236_GPIO_202_PIN_CONTROL) GPIO 202 Pin Control Offset */
#define GPIO_200_236_GPIO_203_PIN_CONTROL_OFFSET (0x0C)         /**< (GPIO_200_236_GPIO_203_PIN_CONTROL) GPIO 203 Pin Control Offset */
#define GPIO_200_236_GPIO_204_PIN_CONTROL_OFFSET (0x10)         /**< (GPIO_200_236_GPIO_204_PIN_CONTROL) GPIO 204 Pin Control Offset */
#define GPIO_200_236_GPIO_205_PIN_CONTROL_OFFSET (0x14)         /**< (GPIO_200_236_GPIO_205_PIN_CONTROL) GPIO 205 Pin Control Offset */
#define GPIO_200_236_GPIO_206_PIN_CONTROL_OFFSET (0x18)         /**< (GPIO_200_236_GPIO_206_PIN_CONTROL) GPIO 206 Pin Control Offset */
#define GPIO_200_236_GPIO_207_PIN_CONTROL_OFFSET (0x1C)         /**< (GPIO_200_236_GPIO_207_PIN_CONTROL) GPIO 207 Pin Control Offset */
#define GPIO_200_236_GPIO_210_PIN_CONTROL_OFFSET (0x20)         /**< (GPIO_200_236_GPIO_210_PIN_CONTROL) GPIO 210 Pin Control Offset */
#define GPIO_200_236_GPIO_211_PIN_CONTROL_OFFSET (0x24)         /**< (GPIO_200_236_GPIO_211_PIN_CONTROL) GPIO 211 Pin Control Offset */
#define GPIO_200_236_GPIO_212_PIN_CONTROL_OFFSET (0x28)         /**< (GPIO_200_236_GPIO_212_PIN_CONTROL) GPIO 212 Pin Control Offset */
#define GPIO_200_236_GPIO_213_PIN_CONTROL_OFFSET (0x2C)         /**< (GPIO_200_236_GPIO_213_PIN_CONTROL) GPIO 213 Pin Control Offset */
#define GPIO_200_236_GPIO_221_PIN_CONTROL_OFFSET (0x44)         /**< (GPIO_200_236_GPIO_221_PIN_CONTROL) GPIO 221 Pin Control Offset */
#define GPIO_200_236_GPIO_222_PIN_CONTROL_OFFSET (0x48)         /**< (GPIO_200_236_GPIO_222_PIN_CONTROL) GPIO 222 Pin Control Offset */
#define GPIO_200_236_GPIO_223_PIN_CONTROL_OFFSET (0x4C)         /**< (GPIO_200_236_GPIO_223_PIN_CONTROL) GPIO 223 Pin Control Offset */
#define GPIO_200_236_GPIO_224_PIN_CONTROL_OFFSET (0x50)         /**< (GPIO_200_236_GPIO_224_PIN_CONTROL) GPIO 224 Pin Control Offset */
#define GPIO_200_236_GPIO_226_PIN_CONTROL_OFFSET (0x58)         /**< (GPIO_200_236_GPIO_226_PIN_CONTROL) GPIO 226 Pin Control Offset */
#define GPIO_200_236_GPIO_227_PIN_CONTROL_OFFSET (0x5C)         /**< (GPIO_200_236_GPIO_227_PIN_CONTROL) GPIO 227 Pin Control Offset */

/** \brief GPIO_200_236 register API structure */
typedef struct
{  /* GPIO 200:236 Pin Control Registers */
  __IO  __GPIO_200_236_GPIO_200_PIN_CONTROL_bits_t GPIO_200_PIN_CONTROL; /**< Offset: 0x00 (R/W  32) GPIO200 Pin Control */
  __IO  __GPIO_200_236_GPIO_201_PIN_CONTROL_bits_t GPIO_201_PIN_CONTROL; /**< Offset: 0x04 (R/W  32) GPIO 201 Pin Control */
  __IO  __GPIO_200_236_GPIO_202_PIN_CONTROL_bits_t GPIO_202_PIN_CONTROL; /**< Offset: 0x08 (R/W  32) GPIO 202 Pin Control */
  __IO  __GPIO_200_236_GPIO_203_PIN_CONTROL_bits_t GPIO_203_PIN_CONTROL; /**< Offset: 0x0C (R/W  32) GPIO 203 Pin Control */
  __IO  __GPIO_200_236_GPIO_204_PIN_CONTROL_bits_t GPIO_204_PIN_CONTROL; /**< Offset: 0x10 (R/W  32) GPIO 204 Pin Control */
  __IO  __GPIO_200_236_GPIO_205_PIN_CONTROL_bits_t GPIO_205_PIN_CONTROL; /**< Offset: 0x14 (R/W  32) GPIO 205 Pin Control */
  __IO  __GPIO_200_236_GPIO_206_PIN_CONTROL_bits_t GPIO_206_PIN_CONTROL; /**< Offset: 0x18 (R/W  32) GPIO 206 Pin Control */
  __IO  __GPIO_200_236_GPIO_207_PIN_CONTROL_bits_t GPIO_207_PIN_CONTROL; /**< Offset: 0x1C (R/W  32) GPIO 207 Pin Control */
  __IO  __GPIO_200_236_GPIO_210_PIN_CONTROL_bits_t GPIO_210_PIN_CONTROL; /**< Offset: 0x20 (R/W  32) GPIO 210 Pin Control */
  __IO  __GPIO_200_236_GPIO_211_PIN_CONTROL_bits_t GPIO_211_PIN_CONTROL; /**< Offset: 0x24 (R/W  32) GPIO 211 Pin Control */
  __IO  __GPIO_200_236_GPIO_212_PIN_CONTROL_bits_t GPIO_212_PIN_CONTROL; /**< Offset: 0x28 (R/W  32) GPIO 212 Pin Control */
  __IO  __GPIO_200_236_GPIO_213_PIN_CONTROL_bits_t GPIO_213_PIN_CONTROL; /**< Offset: 0x2C (R/W  32) GPIO 213 Pin Control */
  __IO  __GPIO_200_236_GPIO_221_PIN_CONTROL_bits_t GPIO_221_PIN_CONTROL; /**< Offset: 0x44 (R/W  32) GPIO 221 Pin Control */
  __IO  __GPIO_200_236_GPIO_222_PIN_CONTROL_bits_t GPIO_222_PIN_CONTROL; /**< Offset: 0x48 (R/W  32) GPIO 222 Pin Control */
  __IO  __GPIO_200_236_GPIO_223_PIN_CONTROL_bits_t GPIO_223_PIN_CONTROL; /**< Offset: 0x4C (R/W  32) GPIO 223 Pin Control */
  __IO  __GPIO_200_236_GPIO_224_PIN_CONTROL_bits_t GPIO_224_PIN_CONTROL; /**< Offset: 0x50 (R/W  32) GPIO 224 Pin Control */
  __IO  __GPIO_200_236_GPIO_226_PIN_CONTROL_bits_t GPIO_226_PIN_CONTROL; /**< Offset: 0x58 (R/W  32) GPIO 226 Pin Control */
  __IO  __GPIO_200_236_GPIO_227_PIN_CONTROL_bits_t GPIO_227_PIN_CONTROL; /**< Offset: 0x5C (R/W  32) GPIO 227 Pin Control */
} gpio200236_registers_t;
/** @}  end of GPIO 200:236 Pin Control Registers */

#endif /* _PIC32CX_0525SG12_GPIO_200_236_COMPONENT_H_ */
